{
  "backend/main.mo": "Main backend actor implementing user profiles, partner/sponsor/affiliate management with subscription-based access control, Stripe payment integration, and role-based authorization using AccessControl and MixinAuthorization modules.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features (admin/user authentication, partner tracking, Stripe integration, and Twitch-themed design) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and styling, describing their roles in authentication, partner management, Stripe checkout, and Moonlight Rebels theming.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with custom design tokens for light and dark modes, implementing Moonlight Rebels pink and purple theme throughout the application.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Moonlight Rebels application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, partners, admin, and payment pages, wrapped in ThemeProvider and Toaster for dark mode and notifications.",
  "frontend/src/components/AdminGuard.tsx": "Protected route component that verifies admin permissions using Internet Identity and displays appropriate loading, login prompt, or access denied screens for unauthorized users.",
  "frontend/src/components/BioSection.tsx": "Bio section component presenting Aurora's story as a medical mute gamer with inspirational messaging, icons, and styled cards highlighting community values and inclusivity.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, Caffeine.ai attribution with UTM tracking parameters, and Twitch social link with responsive layout.",
  "frontend/src/components/Header.tsx": "Sticky header component with logo, navigation links (Home, Partners, Admin), and a mobile hamburger menu that includes the LoginButton component.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that combines Header, Footer, and children content in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login/logout states using Internet Identity, with loading states and query cache clearing on logout.",
  "frontend/src/components/PartnerCard.tsx": "Displays partner information with badges for type and category, showing locked/blurred content for users without subscriptions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to create their profile by entering their name, with form validation and loading states.",
  "frontend/src/components/StripeSetup.tsx": "Admin form component for configuring Stripe integration with secret key and allowed countries list.",
  "frontend/src/components/SubscriptionCheckout.tsx": "Subscription purchase component that creates a Stripe checkout session for $9.99/month premium access and redirects to Stripe.",
  "frontend/src/components/TwitchButton.tsx": "External link button component that directs users to the Twitch channel 'auroramoonveil' with Twitch branding.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, partners, subscriptions, Stripe configuration, and shopping items via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a \"Moonlight Rebels\" theme (purple/pink color scheme) for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page protected by AdminGuard that displays Stripe configuration status and provides CRUD operations for managing partners with form inputs and delete confirmations.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring hero section with branding, profile setup modal for new users, bio section, Twitch integration button, and community features grid.",
  "frontend/src/pages/PartnersPage.tsx": "Displays partner/sponsor cards with subscription-gated content, showing login prompt for unauthenticated users and subscription checkout for authenticated non-subscribers.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment cancellation page displaying an error state with XCircle icon and two action buttons: 'Try Again' linking to /partners and 'Back to Home' linking to root.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page that invalidates subscription and partner queries on mount, displays a success message with CheckCircle icon, and provides navigation to /partners or home.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup functions for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space (including moonlight/rebel brand colors), container settings, border radius variables, and animation keyframes for accordions.",
  "project_state.json": "Project metadata tracking implemented features for a Twitch streamer website with dual authentication, partner/subscription management, Stripe integration, and pink/purple branding for Moonlight Rebels."
}